app/controllers/bands_controller.rb

	def index
		@user = current_user.id
		@bands = Band.where user_id: @user
---
SELECT  "bands".* FROM "bands" WHERE "bands"."user_id" = ? LIMIT 1  [["user_id", 1]]

	def create
		@user = current_user.id
		@band = Band.new band_params
		if @band.save
---
INSERT INTO "bands" ("name", "spotifyID", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dani"], ["spotifyID", "2UKGuGLvM4j4qbxaGslLWT"], ["picture", "url_picture"], ["user_id", 1], ["created_at", "2016-02-29 17:45:13.364786"], ["updated_at", "2016-02-29 17:45:13.364786"]]

  def destroy
  	@user = current_user.id
  	@band = Band.find params[:id]
  	@band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT 1  [["id", 29]]
DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 29]]