app/controllers/home_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."user_id" = ?  [["user_id", 1]]
SELECT  "spotifies".* FROM "spotifies" WHERE "spotifies"."band_id" = ?  ORDER BY "spotifies"."id" DESC LIMIT 1  [["band_id", 1]]
---
  def index
  	@userId=current_user.id
  	@bands = Band.where user_id: @userId
  	@bands_to_show=[]
  	@bands.each do |item|
  		last_record= Spotify.where(band_id: item.id).last