app/controllers/spotifies_controller.rb

	def index
		@update_result=[]
		Band.all.each do |item|
---
SELECT  "bands".* FROM "bands"  ORDER BY "bands"."id" DESC LIMIT 1